# AddAnnotation Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCProductWrapper..::..AddAnnotation Method
IFCProductWrapper Class See Also
---
Adds an annotation handle to associate with the IfcProduct in this wrapper.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void AddAnnotation(
	IFCAnyHandle annoHnd,
	IFCLevelInfo levelInfo,
	bool relateToLevel
)
```

Visual Basic
---
```text
Public Sub AddAnnotation ( _
	annoHnd As IFCAnyHandle, _
	levelInfo As IFCLevelInfo, _
	relateToLevel As Boolean _
)
```

Visual C++
---
```text
public:
void AddAnnotation(
	IFCAnyHandle^ annoHnd,
	IFCLevelInfo^ levelInfo,
	bool relateToLevel
)
```

# ### Parameters
annoHnd
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The annotation handle.
levelInfo
    Type: Autodesk.Revit.DB.IFC..::..IFCLevelInfo Information on the associated level. Optional, can be nullNothingnullptra null reference (Nothing in Visual Basic).
relateToLevel
    Type: System..::..Boolean True to relate the annotation to the level, false otherwise.
# Remarks
If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace